# Алгоритм k ближайших соседей, машинное обучение, торги на биржах и всё такое

# Для определения объекта надо рассмотреть его ближайших соседей
# и на их основе делать вывод об объекте

# Близкорасположенные друг к другу объекты имеют схожие значения
# целевой переменной

# Классификация = распределение по категориям
# Регрессия = прогнозирование ответа (н-р числом)
# Извлечение признаков = преобразование элемента в список чисел для сравнения

# Расстояние вычисляется по теореме Пифагора (признаков неограниченное кол-во)