# Бинарное дерево поиска. По сравнению с бинарным поиском
# быстро работают вставка и удаление
#
# Инвертированные индексы. Хеш-табл где ключ-слово, а значение-сайт (поисковик)
#
# Преобразование Фурье. Разложить элемент на составляющие => можно удалить
# несущественные составляющие => это сжатие
#
# Параллельные алгоритмы (многопоточность). MapReduce.
# Map - преобразует каждый элемент массива
# Reduce - преобразует элементы массива в один элемент (н-р их сложение)
#
# Фильтры Блума и HyperLogLog. Занимают мало памяти, но дают не 100% верный
# ответ. Но как альтернатива трилионным хеш-таблицам пойдёт
#
# Алгоритмы SHA (Secure Hash Algorithm). Получает строку, возвр хеш-код.
#
# Алгоритм Диффи-Хеллмана. Шифровка: открытый и закрытый ключ